package com.mystudy.ex01_scanner;

import java.util.Scanner;

public class Practice {
	private int money; //통장계좌(금액)
	int choice = -1;
	Scanner scan = new Scanner(System.in);
	//[실습] 은행의 ATM
	//1.입금 2.출금 3.통장확인 0.종료
	//------------------------
	//계좌를 하나 만들고 입금/출금/통장확인 작업을 처리
	/* *********************
	>> 어서오세요
	------------------------
	1.입금  2.출금  3.통장확인  0.종료
	------------------------
	>>작업선택 : 1
	>>입금액 : 10000
	::통장금액 : 10000원

	------------------------
	1.입금  2.출금  3.통장확인  0.종료
	------------------------
	>>작업선택 : 2
	>>출금액 : 5000
	::통장금액 : 5000원

	------------------------
	1.입금  2.출금  3.통장확인  0.종료
	------------------------
	>>작업선택 : 3
	::통장금액 : 5000원

	------------------------
	1.입금  2.출금  3.통장확인  0.종료
	------------------------
	>>작업선택 : 0
	>>작업을 종료했습니다.
	******************************/
}
